[
  {
    "id": 1,
    "title": "Zawadi Archive: Preserving Oral Histories",
    "category": "Culture / Archive",
    "time": "3h ago",
    "excerpt": "An initiative to digitise personal stories and recordings from elders across the region, making them accessible for researchers and communities.",
    "image": "images/zawadi-cover.png",
    "url": "news.html"
  },
  {
    "id": 2,
    "title": "Why Russia Continues Bombing Ukraine Despite NATO Support",
    "category": "Geopolitics",
    "time": "20 Oct 2025",
    "excerpt": "Russia has intensified its bombing campaign across Ukraine, targeting cities like Odessa and Kyiv. Despite NATO aid, Moscow aims to destabilize Ukraine and pressure Western resolve through aerial assaults.",
    "image": "images/russia-air defense.png",
    "url": "news.html"
  },
  {
    "id": 3,
    "title": "Gaza War: Why Israel Bombed Gaza",
    "category": "Middle East / Conflict",
    "time": "Oct 2025",
    "excerpt": "Following Hamas's October 7 attack, Israel launched a sustained bombing campaign across Gaza. The strikes sparked global debate over proportionality, humanitarian impact, and accountability.",
    "image": "images/gaza-bombing.jpg",
    "url": "middle east.html"
  },
  {
    "id": 4,
    "title": "Raila Odinga: End of an Era — Kenya Bids Farewell",
    "category": "National Tribute",
    "time": "15 Oct 2025",
    "excerpt": "Thousands gathered to honor Rt. Hon. Raila Odinga in a state funeral marked by military honors, cultural performances, and tributes from leaders across Africa.",
    "image": "images/raila-cover.png",
    "url": "news.html"
  },
  {
    "id": 5,
    "title": "Vinka Unleashes “La La La”",
    "category": "Arts & Culture",
    "time": "9 Oct 2025",
    "excerpt": "Vinka's new single delivers a bold dancehall vibe with catchy melodies and confident energy, marking a fresh chapter in her sonic evolution.",
    "image": "images/Vinka.png",
    "url": "news.html"
  },
  {
    "id": 6,
    "title": "Mahesh: The Unstoppable Journey — From Rebellion to Redemption",
    "category": "Memoir & Transformation",
    "time": "20 Oct 2025",
    "excerpt": "A powerful memoir charting Mahesh's transformative journey from defiance to spiritual awakening and redemption.",
    "image": "images/mahesh-cover.png",
    "url": "news.html"
  },
  {
    "id": 7,
    "title": "Trending Movie: The Last Horizon",
    "category": "Culture / Film",
    "time": "Oct 2025",
    "excerpt": "A haunting sci-fi drama exploring humanity's final mission to colonize a distant planet. Streaming now across major platforms.",
    "image": "images/last-horizon.png",
    "url": "global.html"
  }
]
